ОБУЧЕНИЕ/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРеализации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОБУЧЕНИЕ/src/Documents/ЗаказКлиента/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Товар = Элементы.Товары.ТекущиеДанные;
 	Товар.ЦенаРеализации = ОпределитьЦенаРеализации(Товар.Номенклатура);

КонецПроцедуры

&НаСервере
Функция ОпределитьЦенаРеализации(Номенклатура)
	
	Возврат Номенклатура.ЦенаРеализации;	

КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации;  
	
 КонецПроцедуры

&НаКлиенте
 Процедура ТоварыЦенаРеализацииПриИзменении(Элемент)
	 
	 Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации;
	 
 КонецПроцедуры
